<template>
  <section class="content_two">
    <div class="search search-top">
      <input
        type="text"
        name=""
        placeholder="내가 원하는 종목, 신호캐치를 검색해보세요"
        disabled
      />
      <button>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
        >
          <g clip-path="url(#clip0_277_467)">
            <path
              d="M22.2929 23.7071C22.6834 24.0976 23.3166 24.0976 23.7071 23.7071C24.0976 23.3166 24.0976 22.6834 23.7071 22.2929L22.2929 23.7071ZM18.1176 10.0588C18.1176 14.5096 14.5096 18.1176 10.0588 18.1176V20.1176C15.6142 20.1176 20.1176 15.6142 20.1176 10.0588H18.1176ZM10.0588 18.1176C5.60806 18.1176 2 14.5096 2 10.0588H0C0 15.6142 4.50349 20.1176 10.0588 20.1176V18.1176ZM2 10.0588C2 5.60806 5.60806 2 10.0588 2V0C4.50349 0 0 4.50349 0 10.0588H2ZM10.0588 2C14.5096 2 18.1176 5.60806 18.1176 10.0588H20.1176C20.1176 4.50349 15.6142 0 10.0588 0V2ZM15.8223 17.2365L22.2929 23.7071L23.7071 22.2929L17.2365 15.8223L15.8223 17.2365Z"
              fill="#5368FF"
            />
          </g>
          <defs>
            <clipPath id="clip0_277_467">
              <rect width="24" height="24" fill="white" />
            </clipPath>
          </defs>
        </svg>
      </button>
    </div>
    <!-- 상단검색 -->

    <div class="item_info_catch">
      <div class="item_info">
        <div class="top">
          <div class="item">
            <span>삼성전자</span>
          </div>
          <!-- 종목명 -->

          <div class="info">
            <span>001500</span>
            <span>코스피</span>
            <span>증권</span>
          </div>
          <!-- 종목정보 -->
        </div>

        <div class="price">
          <strong>1,201,000</strong>
          <span>0.48%</span>
        </div>
      </div>
      <!-- 종목정보 -->

      <div class="item_card">
        <ItemCard></ItemCard>
      </div>
      <!-- 특이사항&장마감요약 -->
    </div>
    <!-- 종목특이사항캐치 -->

    <div class="signal_alarm_banner">
      <div class="banner">
        <div class="visual">
          <strong>내 종목 언제 매도해야 하나요?</strong>
          <span>
            <em>검증된 AI</em>가 <br />
            <em>정확한 매매타점</em>에 <br />
            <em>앱알림</em>을 보내드립니다.
          </span>
        </div>
        <div class="list">
          <div>
            <span class="date">11.22</span>
            <span class="obj">종목명종목명종목명종목명</span>
            <span class="per">+115.78% 달성</span>
          </div>
          <div>
            <span class="date">11.22</span>
            <span class="obj">종목명종목명종목명종목명</span>
            <span class="per">+115.78% 달성</span>
          </div>
        </div>
      </div>
    </div>
    <!-- 신호알림배너 -->

    <div class="signal_catch_w">
      <div class="top">
        <div class="title">
          <strong></strong>
          <button class="setting">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
            >
              <path
                d="M16.9583 7.43577L16.6531 7.266C16.6057 7.23964 16.5824 7.22641 16.5595 7.2127C16.332 7.07638 16.1401 6.88803 16.0002 6.66269C15.9861 6.64002 15.9728 6.61624 15.9457 6.56925C15.9186 6.52231 15.9048 6.49853 15.8922 6.47499C15.7666 6.24055 15.6987 5.97929 15.6947 5.71338C15.6943 5.68665 15.6943 5.65934 15.6953 5.60504L15.7012 5.25065C15.7108 4.68355 15.7156 4.39911 15.6359 4.14385C15.5651 3.91711 15.4466 3.70827 15.2885 3.53104C15.1097 3.33071 14.8623 3.18779 14.3669 2.9023L13.9554 2.66517C13.4613 2.38048 13.2142 2.23809 12.9519 2.18381C12.7199 2.13578 12.4804 2.13801 12.2492 2.18991C11.9883 2.24849 11.7443 2.39459 11.2566 2.68663L11.2538 2.68796L10.9589 2.86451C10.9123 2.89242 10.8887 2.9065 10.8653 2.91949C10.6334 3.04842 10.3746 3.11971 10.1094 3.12822C10.0826 3.12908 10.0555 3.12908 10.0011 3.12908C9.94706 3.12908 9.91871 3.12908 9.89204 3.12822C9.62627 3.11968 9.36685 3.04799 9.13459 2.91853C9.11118 2.90548 9.08803 2.8913 9.04131 2.86325L8.74458 2.68511C8.25352 2.3903 8.00762 2.24268 7.74523 2.18381C7.51309 2.13172 7.27281 2.13028 7.03992 2.17892C6.77696 2.23385 6.5298 2.3773 6.03549 2.66419L6.03329 2.66517L5.6269 2.90103L5.6224 2.90378C5.13254 3.1881 4.88701 3.3306 4.70975 3.53012C4.55245 3.70717 4.43487 3.91568 4.3645 4.14181C4.28495 4.39743 4.28919 4.68247 4.29878 5.25225L4.30473 5.60613C4.30563 5.65972 4.3072 5.68635 4.30681 5.71271C4.30286 5.97916 4.23405 6.24095 4.10812 6.4758C4.09567 6.49902 4.08225 6.52225 4.05545 6.56864C4.02863 6.61507 4.01565 6.63816 4.00174 6.66056C3.86114 6.8871 3.66845 7.07655 3.43944 7.2131C3.41679 7.22661 3.39292 7.2396 3.34601 7.26559L3.04471 7.43257C2.5434 7.71037 2.29281 7.8494 2.11046 8.04725C1.94915 8.22227 1.82729 8.42987 1.75291 8.65597C1.66882 8.91156 1.66889 9.19815 1.6702 9.77129L1.67126 10.2397C1.67255 10.809 1.67433 11.0935 1.7586 11.3474C1.83316 11.5719 1.95412 11.7783 2.11453 11.9523C2.29585 12.1489 2.54395 12.2871 3.04145 12.5639L3.34007 12.73C3.39089 12.7582 3.41646 12.7722 3.44097 12.787C3.6679 12.9236 3.85908 13.1125 3.99848 13.3378C4.01354 13.3621 4.028 13.3874 4.05691 13.4379C4.08547 13.4878 4.10007 13.5127 4.11328 13.5377C4.23551 13.7691 4.30095 14.0262 4.30541 14.2879C4.30589 14.3162 4.30548 14.3448 4.30451 14.4022L4.29878 14.7418C4.28912 15.3136 4.28492 15.5998 4.36494 15.8561C4.43572 16.0828 4.55403 16.2916 4.71219 16.4689C4.89096 16.6692 5.13879 16.8121 5.63423 17.0975L6.04565 17.3346C6.53969 17.6193 6.78662 17.7615 7.04891 17.8158C7.28095 17.8638 7.52054 17.862 7.75174 17.8101C8.01305 17.7514 8.2579 17.6048 8.74702 17.3119L9.04187 17.1354C9.08852 17.1075 9.11214 17.0934 9.13551 17.0805C9.36741 16.9515 9.62603 16.8799 9.89123 16.8713C9.91795 16.8705 9.94514 16.8705 9.9995 16.8705C10.054 16.8705 10.0812 16.8705 10.1079 16.8714C10.3737 16.8799 10.6339 16.9518 10.8662 17.0813C10.8866 17.0927 10.9071 17.105 10.943 17.1266L11.2565 17.3147C11.7476 17.6096 11.993 17.7568 12.2554 17.8157C12.4875 17.8677 12.728 17.8699 12.9609 17.8212C13.2238 17.7663 13.4714 17.6226 13.9655 17.3358L14.378 17.0964C14.8682 16.8119 15.1139 16.6693 15.2913 16.4697C15.4486 16.2926 15.5663 16.0842 15.6367 15.8581C15.7156 15.6043 15.7109 15.3215 15.7014 14.7599L15.6953 14.3937C15.6944 14.3401 15.6943 14.3134 15.6946 14.2871C15.6986 14.0206 15.7663 13.7587 15.8922 13.5238C15.9046 13.5006 15.9182 13.4772 15.9449 13.431C15.9717 13.3845 15.9856 13.3614 15.9995 13.339C16.1401 13.1125 16.333 12.9228 16.562 12.7863C16.5843 12.7729 16.6074 12.7602 16.6532 12.7348L16.6547 12.7341L16.956 12.5671C17.4573 12.2893 17.7084 12.1501 17.8908 11.9523C18.0521 11.7773 18.1738 11.5699 18.2482 11.3438C18.3317 11.0898 18.3311 10.8048 18.3298 10.2384L18.3287 9.7599C18.3274 9.19059 18.3267 8.90616 18.2425 8.65231C18.1679 8.42773 18.0463 8.22134 17.8859 8.04737C17.7047 7.85092 17.4563 7.71271 16.9597 7.43648L16.9583 7.43577Z"
                stroke="#CACACA"
                stroke-width="1.5"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M6.66694 9.99997C6.66694 11.8409 8.15933 13.3333 10.0003 13.3333C11.8412 13.3333 13.3336 11.8409 13.3336 9.99997C13.3336 8.15902 11.8412 6.66664 10.0003 6.66664C8.15933 6.66664 6.66694 8.15902 6.66694 9.99997Z"
                stroke="#CACACA"
                stroke-width="1.5"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
            <span>설정</span>
          </button>
          <button class="alarm">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              class="off"
            >
              <path
                d="M19 13V13.7224C19 13.9001 19.0706 14.0706 19.1963 14.1963L19.5858 14.5858C19.7047 14.7048 19.7651 14.7651 19.8126 14.8312C19.9024 14.9563 19.9614 15.1004 19.9863 15.2524C19.9995 15.3329 19.9997 15.4172 19.9997 15.5859C19.9997 15.9715 19.9997 16.1643 19.9473 16.3198C19.8475 16.6156 19.616 16.848 19.3201 16.9478C19.1652 17 18.973 17 18.5905 17H15M12 3C8.13401 3.00001 5 6.13401 5 10V13.7224C5 13.9002 4.92924 14.0706 4.80357 14.1963L4.41406 14.5858C4.29477 14.7051 4.23504 14.765 4.1875 14.8312C4.09766 14.9564 4.03815 15.1004 4.0132 15.2524C4 15.3329 4 15.4172 4 15.586C4 15.9715 4 16.1642 4.05245 16.3197C4.15225 16.6156 4.3848 16.848 4.68066 16.9478C4.83556 17 5.02701 17 5.40956 17H9M15 17V18C15 19.6569 13.6569 21 12 21C10.3431 21 9 19.6569 9 18V17M15 17H9"
                stroke="#999999"
                stroke-width="1.5"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <line
                x1="17.75"
                y1="2.75"
                x2="17.75"
                y2="9.25"
                stroke="#999999"
                stroke-width="1.5"
                stroke-linecap="round"
              />
              <line
                x1="14.75"
                y1="6.25"
                x2="21.25"
                y2="6.25"
                stroke="#999999"
                stroke-width="1.5"
                stroke-linecap="round"
              />
            </svg>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              class="on"
            >
              <path
                d="M14.9996 17V18C14.9996 19.6569 13.6564 21 11.9996 21C10.3427 21 8.99958 19.6569 8.99958 18V17M14.9996 17H8.99958M14.9996 17H18.5901C18.9726 17 19.1648 17 19.3197 16.9478C19.6155 16.848 19.847 16.6156 19.9468 16.3198C19.9993 16.1643 19.9993 15.9715 19.9993 15.5859C19.9993 15.4172 19.9991 15.3329 19.9859 15.2524C19.961 15.1004 19.902 14.9563 19.8121 14.8312C19.7647 14.7651 19.7043 14.7048 19.5854 14.5858L19.1959 14.1963C19.0702 14.0706 18.9996 13.9001 18.9996 13.7224V10C18.9996 6.134 15.8656 2.99999 11.9996 3C8.13359 3.00001 4.99958 6.13401 4.99958 10V13.7224C4.99958 13.9002 4.92882 14.0706 4.80314 14.1963L4.41364 14.5858C4.29435 14.7051 4.23462 14.765 4.18708 14.8312C4.09723 14.9564 4.03772 15.1004 4.01278 15.2524C3.99958 15.3329 3.99958 15.4172 3.99958 15.586C3.99958 15.9715 3.99958 16.1642 4.05203 16.3197C4.15183 16.6156 4.38437 16.848 4.68024 16.9478C4.83514 17 5.02659 17 5.40913 17H8.99958M17.4996 2.01367C17.4996 2.01367 19.9653 4.43177 20.6534 6.01574M6.49951 2.01367C5.1203 3.05299 4.03374 4.43177 3.34567 6.01574"
                stroke="white"
                stroke-width="1.5"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </button>
        </div>
        <!-- 상단 타이틀 -->
        <div class="card">
          <div class="signal sig01">
            <span>오늘<br />매수</span>
          </div>
          <div class="signal sig02">
            <span>오늘<br />매도</span>
          </div>
          <div class="signal sig03">
            <span>관망중</span>
          </div>
          <div class="signal sig04">
            <span>보유중</span>
          </div>
          <!-- 신호 01~04 -->

          <div class="signal-info">
            <div>
              <span>수익률 :</span>
              <em class="up">+23.3%</em>
            </div>
            <div>
              <span>매수가 :</span>
              <em>443,000원</em>
            </div>
            <div>
              <span>신호발생일 :</span>
              <em>2023.11.03</em>
            </div>
            <div>
              아직 발색된<br />
              매매신호가 없습니다.
            </div>
          </div>
          <!-- 신호 내용 퍼센트(색상) 나머지(흰색) -->
        </div>
        <!-- 신호카드 -->
      </div>
      <!-- 상단 -->

      <div class="list_w">
        <div class="tab">
          <button>최근 3개월</button>
          <button>최근 1년</button>
        </div>
        <div class="tabContent">
          <div>
            <div class="chart">
              <img
                src="~/assets/img/demoChart2.png"
                alt="차트데모"
                class="w-full"
              />
            </div>
            <!-- 차트이미지 -->

            <div class="list">
              <div class="list-header">
                <span class="date">거래일자</span>
                <span class="signal">신호</span>
                <span class="price">매매단가</span>
                <span class="per">실현손익률</span>
              </div>
              <div class="list-body">
                <div>
                  <span class="date">2022.11.01</span>
                  <span class="signal up">매수</span>
                  <span class="price">1,144,000</span>
                  <span class="per">-</span>
                </div>
                <div>
                  <span class="date">2022.11.01</span>
                  <span class="signal dn">매도</span>
                  <span class="price">1,144,000</span>
                  <span class="per">+33.3%</span>
                </div>
                <div>
                  <span class="date">2022.11.01</span>
                  <span class="signal up">매수</span>
                  <span class="price">1,144,000</span>
                  <span class="per">-</span>
                </div>
                <div>
                  <span class="date">2022.11.01</span>
                  <span class="signal dn">매도</span>
                  <span class="price">1,144,000</span>
                  <span class="per dn">-0.3%</span>
                </div>
                <div>
                  <span class="date">2022.11.01</span>
                  <span class="signal up">매수</span>
                  <span class="price">1,144,000</span>
                  <span class="per">-</span>
                </div>
              </div>
              <div class="more">
                <button>
                  더보기
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    width="18"
                    height="19"
                    viewBox="0 0 18 19"
                    fill="none"
                  >
                    <path
                      d="M5 7.5L9 11.5L13 7.5"
                      stroke="#666666"
                      stroke-linecap="round"
                      stroke-linejoin="round"
                    />
                  </svg>
                </button>
              </div>
            </div>
            <!-- 신호리스트 -->
          </div>
          <div></div>
        </div>
      </div>
      <!-- 최근3&12개월 -->
    </div>
    <!-- 신호캐치 -->

    <div class="search">
      <input
        type="text"
        name=""
        placeholder="내가 원하는 종목, 신호캐치를 검색해보세요"
      />
      <button>
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
        >
          <g clip-path="url(#clip0_277_467)">
            <path
              d="M22.2929 23.7071C22.6834 24.0976 23.3166 24.0976 23.7071 23.7071C24.0976 23.3166 24.0976 22.6834 23.7071 22.2929L22.2929 23.7071ZM18.1176 10.0588C18.1176 14.5096 14.5096 18.1176 10.0588 18.1176V20.1176C15.6142 20.1176 20.1176 15.6142 20.1176 10.0588H18.1176ZM10.0588 18.1176C5.60806 18.1176 2 14.5096 2 10.0588H0C0 15.6142 4.50349 20.1176 10.0588 20.1176V18.1176ZM2 10.0588C2 5.60806 5.60806 2 10.0588 2V0C4.50349 0 0 4.50349 0 10.0588H2ZM10.0588 2C14.5096 2 18.1176 5.60806 18.1176 10.0588H20.1176C20.1176 4.50349 15.6142 0 10.0588 0V2ZM15.8223 17.2365L22.2929 23.7071L23.7071 22.2929L17.2365 15.8223L15.8223 17.2365Z"
              fill="#5368FF"
            />
          </g>
          <defs>
            <clipPath id="clip0_277_467">
              <rect width="24" height="24" fill="white" />
            </clipPath>
          </defs>
        </svg>
      </button>
    </div>
    <!-- 검색 -->

    <div class="ainews">
      <strong>AI속보</strong>

      <div class="list">
        <div>
          <div class="obj">
            <em class="bullet_ai">Ai</em>
            <span
              >특징주, 삼성전자-HBM(고대역폭메모리) 테마 상승세에 0.83% ↑</span
            >
            <em class="bullet_new">NEW</em>
          </div>
          <!-- 속보내용 -->

          <div class="info">
            <span>09:58</span>
            <span>라씨로</span>
          </div>
          <!-- 속보정보 -->
        </div>

        <div>
          <div class="obj">
            <em class="bullet_ai">Ai</em>
            <span
              >특징주, 삼성전자-HBM(고대역폭메모리) 테마 상승세에 0.83% ↑</span
            >
            <em class="bullet_new">NEW</em>
          </div>
          <!-- 속보내용 -->

          <div class="info">
            <span>09:58</span>
            <span>라씨로</span>
          </div>
          <!-- 속보정보 -->
        </div>

        <div>
          <div class="obj">
            <em class="bullet_ai">Ai</em>
            <span
              >특징주, 삼성전자-HBM(고대역폭메모리) 테마 상승세에 0.83% ↑</span
            >
            <em class="bullet_new">NEW</em>
          </div>
          <!-- 속보내용 -->

          <div class="info">
            <span>09:58</span>
            <span>라씨로</span>
          </div>
          <!-- 속보정보 -->
        </div>

        <div>
          <div class="obj">
            <em class="bullet_ai">Ai</em>
            <span
              >특징주, 삼성전자-HBM(고대역폭메모리) 테마 상승세에 0.83% ↑</span
            >
            <em class="bullet_new">NEW</em>
          </div>
          <!-- 속보내용 -->

          <div class="info">
            <span>09:58</span>
            <span>라씨로</span>
          </div>
          <!-- 속보정보 -->
        </div>

        <div>
          <div class="obj">
            <em class="bullet_ai">Ai</em>
            <span
              >특징주, 삼성전자-HBM(고대역폭메모리) 테마 상승세에 0.83% ↑</span
            >
            <em class="bullet_new">NEW</em>
          </div>
          <!-- 속보내용 -->

          <div class="info">
            <span>09:58</span>
            <span>라씨로</span>
          </div>
          <!-- 속보정보 -->
        </div>
      </div>
      <!-- 속보리스트 -->
      <div class="more">
        <button>
          더보기
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="18"
            height="19"
            viewBox="0 0 18 19"
            fill="none"
          >
            <path
              d="M5 7.5L9 11.5L13 7.5"
              stroke="#666666"
              stroke-linecap="round"
              stroke-linejoin="round"
            />
          </svg>
        </button>
      </div>
    </div>
    <!-- ai속보 -->
  </section>
</template>

<script>
import ItemCard from '~/components/SignalCatch/ItemCard';

export default {
  components: {
    ItemCard,
  },
};
</script>


<style scoped>
  @import "~/assets/css/signal.css";
</style>